---
kind: other
id: Properties.T:Autodesk.Revit.DB.ConnectionValidationWarning
source: html/08168540-a892-c73f-0996-01fa7eb9221b.htm
---
# ConnectionValidationWarning Properties

Specifies whether the .NET object represents a valid Revit entity.